gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_module/generic_module/amod_api.c
	return 0;
};

/**
 * @brief Function to connect two modules together.
 *
 */
int amod_connect(struct amod_handle *handle_from, struct amod_handle *handle_to)
{
	struct _amod_handle *hdl_from = (struct _amod_handle *)handle_from;
	struct _amod_handle *hdl_to = (struct _amod_handle *)handle_to;

	if (handle_from == NULL || handle_to == NULL) {
		LOG_DBG("Invalid paramet for the connection function");
		return -EINVAL;
	}

	if (hdl_from->type == AMOD_TYPE_OUTPUT || hdl_to->type == AMOD_TYPE_INPUT) {
		LOG_DBG("Connections between these modules, %s to %s, is not supported",
			hdl_from->name, hdl_to->name);
		return -ENOTSUP;
	}

	if (hdl->state == AMOD_STATE_UNDEFINED || hdl->state == AMOD_STATE_RUNNING ||
	    hdl->state == AMOD_STATE_OPEN) {
		LOG_DBG("A module is an invalid state or type for connecting modules %s to %s",
			hdl_from->name, hdl_to->name);
		return -ENOTSUP;
	}

	k_mutex_lock(&hdl_from->dest_mutex, K_FOREVER);

	sys_slist_append(&hdl_from->hdl_dest_list, &hdl_to->node);

	hdl_from->dest_count += 1;

	k_mutex_unlock(&hdl_from->dest_mutex);

	return 0;
}

/**
 * @brief Function to disconnect a module.
 *
 */
int amod_disconnect(struct amod_handle *handle, struct amod_handle *handle_disconnect)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	struct _amod_handle *hdl_remove = (struct _amod_handle *)handle_disconnect;

	if (handle == NULL || handle_disconnect == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (hdl->type == AMOD_TYPE_OUTPUT || hdl_remove->type == AMOD_TYPE_INPUT) {
		LOG_DBG("Connections between these modules, %s to %s, is not supported",
			hdl_from->name, hdl_to->name);
		return -ENOTSUP;
	}

	if (hdl->state == AMOD_STATE_UNDEFINED || hdl->state == AMOD_STATE_RUNNING ||
	    hdl->state == AMOD_STATE_OPEN) {
		LOG_DBG("A module is an invalid state or type for disconnection");
		return -ENOTSUP;
	}

	k_mutex_lock(&hdl->dest_mutex, K_FOREVER);

	if (!sys_slist_find_and_remove(&hdl->hdl_dest_list, &hdl_remove->node)) {
		LOG_DBG("Connection to module %s has not been found for module %s",
			hdl_remove->name, hdl->name);
		return -EINVAL;
	}

	hdl->dest_count -= 1;

	k_mutex_unlock(&hdl->dest_mutex);

	return 0;
}

/**
 * @brief Start a module processing data.
 */
int amod_start(struct amod_handle *handle)
{
	int ret;
	struct _amod_handle *hdl = (struct _amod_handle *)handle;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (hdl->state == AMOD_STATE_UNDEFINED || hdl->state == AMOD_STATE_RUNNING ||
	    hdl->state == AMOD_STATE_OPEN) {
		LOG_DBG("Module %s in an invalid state, %d, for set configuration", hdl->name,
			hdl->state);
		return -ENOTSUP;
	}

	if (hdl->functions->start != NULL) {
		ret = hdl->functions->start(handle);
		if (ret < 0) {
			LOG_DBG("Failed user start for module %s, ret %d", hdl->name, ret);
			return ret;
		}
	} else {
		LOG_DBG("No user start function for module %s", hdl->name);
	}

	hdl->previous_state = hdl->state;
	hdl->state = AMOD_STATE_RUNNING;

	return 0;
}

/**
 * @brief Pause a module processing data.
 */
int amod_pause(struct amod_handle *handle)
{
	int ret;
	struct _amod_handle *hdl = (struct _amod_handle *)handle;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (hdl->state != AMOD_STATE_RUNNING) {
		LOG_DBG("Module %s in an invalid state, %d, for set configuration", hdl->name,
			hdl->state);
		return -ENOTSUP;
	}

	if (hdl->functions->pause != NULL) {
		ret = hdl->functions->pause(handle);
		if (ret < 0) {
			LOG_DBG("Failed user pause for module %s, ret %d", hdl->name, ret);
			return ret;
		}
	} else {
		LOG_DBG("No user pause function for module %s", hdl->name);
	}

	hdl->previous_state = hdl->state;
	hdl->state = AMOD_STATE_PAUSED;

	return 0;
}

/**
 * @brief Send a data buffer to a module.
 */
int amod_data_tx(struct amod_handle *handle, struct aobj_object *object,
		 amod_response_cb response_cb)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (object == NULL) {
		LOG_DBG("Module , %s, data parameter error", hdl->name);
		return -ECONNREFUSED;
	}

	if (hdl->state != AMOD_STATE_RUNNING || hdl->type == AMOD_TYPE_INPUT) {
		LOG_DBG("Module %s in an invalid state (%d) or type (%d) to send data", hdl->name,
			hdl->state, hdl->type);
		return -ENOTSUP;
	}

	return data_tx((void *)NULL, hdl, object, response_cb);
}

/**
 * @brief Retrieve data from the module.
 *
 */
int amod_data_rx(struct amod_handle *handle, struct aobj_object *object)
{
	int ret;
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	struct _amod_out_message *out_msg;
	size_t out_msg_size;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (hdl->state != AMOD_STATE_RUNNING || hdl->type == AMOD_TYPE_OUTPUT) {
		LOG_DBG("Module %s in an invalid state (%d) or type (%d) to receive data",
			hdl->name, hdl->state, hdl->type);
		return -ENOTSUP;
	}

	if (object == NULL) {
		LOG_DBG("Error in output object for module %s", hdl->name);
		return -ECONNREFUSED;
	}

	if (object->data == NULL || object->data_size == 0) {
		LOG_DBG("Error in output data buffer for module %s", hdl->name);
		return -ECONNREFUSED;
	}

	ret = data_fifo_pointer_last_filled_get(&hdl->out_msg, (void **)&out_msg, &out_msg_size,
						K_FOREVER);
	if (ret) {
		LOG_DBG("Failed to retrieve data from module %s, ret %d", hdl->name, ret);
		return ret;
	}

	if (out_msg->object.data == NULL || out_msg->object.data_size == 0) {
		LOG_DBG("Data output buffer too small for received buffer from module %s",
			hdl->name);
		return -EINVAL;
	}

	memcpy(object, &out_msg->object, sizeof(struct aobj_object));

	data_fifo_block_free(&hdl->out_msg, (void **)&out_msg);

	return 0;
}

/**
 * @brief Send data and retrieve the processed data from the module.
 */
int amod_data_rx_tx(struct amod_handle *handle, struct aobj_object *object_in,
		    struct aobj_object *object_out)
{
	int ret;
	struct _amod_handle *hdl = (struct _amod_handle *)handle;
	struct _amod_out_message *out_msg;
	size_t out_msg_size;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (hdl->state != AMOD_STATE_RUNNING || hdl->type != AMOD_TYPE_PROCESSOR) {
		LOG_DBG("Module %s is in an invalid state, (%d) or type (%d) to send-receive data",
			hdl->name, hdl->state, hdl->type);
		return -ENOTSUP;
	}

	if (object_in == NULL || object_out == NULL) {
		LOG_DBG("Error in audio object pointer for module %s", hdl->name);
		return -ECONNREFUSED;
	}

	if (object_in->data == NULL || object_in->data_size == 0) {
		LOG_DBG("Error in input audio object for module %s", hdl->name);
		return -ECONNREFUSED;
	}

