gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_module/generic_module/amod_api.c
	if (object_out->data == NULL || object_out->data_size == 0) {
		LOG_DBG("Error in output audio object for module %s", hdl->name);
		return -ECONNREFUSED;
	}

	ret = data_tx(NULL, hdl, object_in, NULL);
	if (ret) {
		LOG_DBG("Failed to send data to module %s, ret %d", hdl->name, ret);
		return ret;
	}

	ret = data_fifo_pointer_last_filled_get(&hdl->out_msg, (void **)&out_msg, &out_msg_size,
						K_FOREVER);
	if (ret) {
		LOG_DBG("Failed to retrieve data from module %s, ret %d", hdl->name, ret);
		return ret;
	}

	if (out_msg->object.data == NULL || out_msg->object.data_size == 0) {
		LOG_DBG("Data output buffer too small for received buffer from module %s",
			hdl->name);
		return -EINVAL;
	}

	memcpy(object_out, &out_msg->object, sizeof(struct aobj_object));

	data_fifo_block_free(&hdl->out_msg, (void **)&out_msg);

	return 0;
};

/**
 * @brief Helper function to configure the thread information for the module
 *        set-up parameters structure.
 *
 */
int amod_parameters_configure(struct amod_parameters *parameters,
			      const struct amod_description *description, k_thread_stack_t *stack,
			      size_t stack_size, int priority, int in_msg_num, int out_msg_num)
{
	if (parameters == NULL) {
		LOG_DBG("Error parameters pointer is NULL");
		return -EINVAL;
	}

	parameters->description = description;
	parameters->thread.stack = stack;
	parameters->thread.stack_size = stack_size;
	parameters->thread.priority = priority;
	parameters->thread.in_msg_num = in_msg_num;
	parameters->thread.out_msg_num = out_msg_num;

	return 0;
}

/**
 * @brief Helper function to return the base and instance names for a given
 *        module handle.
 *
 */
int amod_names_get(struct amod_handle *handle, char *base_name, char *instance_name)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;

	if (handle == NULL || base_name == NULL || instance_name == NULL) {
		LOG_DBG("Input parameter is NULL");
		return -EINVAL;
	}

	if (hdl->state >= AMOD_STATE_UNKNOWN) {
		LOG_DBG("Module %s is in an invalid state, %d, for get names", hdl->name,
			hdl->state);
		return -ENOTSUP;
	}

	memcpy(base_name, &hdl->base_name, sizeof(hdl->base_name));
	memcpy(instance_name, &hdl->name, sizeof(hdl->name));

	return 0;
}

/**
 * @brief Helper function to return the base and instance names for a given
 *        module handle.
 */
int amod_state_get(struct amod_handle *handle)
{
	struct _amod_handle *hdl = (struct _amod_handle *)handle;

	if (handle == NULL) {
		LOG_DBG("Input parameter is NULL");
		return -EINVAL;
	}

	if (hdl->state >= AMOD_STATE_UNKNOWN) {
		LOG_DBG("Module %s is in an invalid state, %d, for get names", hdl->name,
			hdl->state);
		return -ENOTSUP;
	}

	return hdl->state;
};

/**
 * @brief Helper function to fill an audio data object.
 *
 */
int amod_object_fill(struct aobj_object *object, enum aobj_type data_type, char *data,
		     size_t data_size, struct aobj_format *format, struct aobj_sync *sync_data,
		     bool bad_frame, bool last_flag, void *user_data)
{
	if (object == NULL) {
		LOG_DBG("Input object parameter is NULL");
		return -EINVAL;
	}

	object->data_type = data_type;
	object->data = data;
	object->data_size = data_size;
	object->format = *format;
	object->sync_data = *sync_data;
	object->bad_frame = bad_frame;
	object->last_flag = last_flag;
	object->user_data = user_data;

	return 0;
};

/**
 * @brief Helper function to extract the audio data from an audio object.
 *
 */
int amod_object_data_extract(struct aobj_object *object, char *data, size_t *data_size)
{
	if (object == NULL) {
		LOG_DBG("Input object parameter is NULL");
		return -EINVAL;
	}

	data = object->data;
	*data_size = object->data_size;

	return 0;
}
